/**
  ******************************************************************************
  * 文件名程: bsp_crc.c 
  * 作    者: 硬石嵌入式开发团队
  * 版    本: V1.0
  * 编写日期: 2015-10-04
  * 功    能: CRC循环冗余校验驱动
  ******************************************************************************
  * 说明：
  * 本例程配套硬石stm32开发板YS-F1Pro使用。
  * 
  * 淘宝：
  * 论坛：http://www.ing10bbs.com
  * 版权归硬石嵌入式开发团队所有，请勿商用。
  ******************************************************************************
  */

/* 包含头文件 ----------------------------------------------------------------*/
#include "crc/bsp_crc.h"

/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
CRC_HandleTypeDef hcrc;

/* 扩展变量 ------------------------------------------------------------------*/
/* 私有函数原形 --------------------------------------------------------------*/
/* 函数体 --------------------------------------------------------------------*/
/**
  * 函数功能: CRC循环冗余校验初始化
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  */
void MX_CRC_Init(void)
{
  hcrc.Instance = CRC;
  HAL_CRC_Init(&hcrc);
}

/**
  * 函数功能: CRC循环冗余校验初始化配置
  * 输入参数: hcrc：CRC外设句柄指针
  * 返 回 值: 无
  * 说    明: Hal库内部调用
  */
void HAL_CRC_MspInit(CRC_HandleTypeDef* hcrc)
{

  if(hcrc->Instance==CRC)
  {
    /* 外设时钟使能 */
    __HAL_RCC_CRC_CLK_ENABLE();
  }
}

/**
  * 函数功能: CRC循环冗余校验反初始化配置
  * 输入参数: hcrc：CRC外设句柄指针
  * 返 回 值: 无
  * 说    明: Hal库内部调用
  */
void HAL_CRC_MspDeInit(CRC_HandleTypeDef* hcrc)
{

  if(hcrc->Instance==CRC)
  {
    /* 禁用CRC外设时钟 */
    __HAL_RCC_CRC_CLK_DISABLE();
  }
} 
/******************* (C) COPYRIGHT 2015-2020 硬石嵌入式开发团队 *****END OF FILE****/
